[
  {
    "title": "CF-SRシリーズのイラストです",
    "snippet": "/static/images/2.png"
  },
  {
    "title": "CF-SRシリーズのイラストです",
    "snippet": "本製品には、付属品以外に以下の取扱説明書があります。合わせてご覧ください。  - 「取扱説明書 基本ガイド』  - 「取扱説明書 活用ガイド』  以下のURLを参照してください:  [https://askpc.panasonic.co.jp/dl/manual.html#consumer](https://askpc.panasonic.co.jp/dl/manual.html#consumer) QR: /static/images/1.png  - 「取扱説明書 操作マニュアル』  - 「取扱説明書 Windows 入門ガイド」  (タスクバーのをクリック) - (マニュアル選択) をクリックする  マニュアル選択ユーティリティが起動します。この画面でご覧になりたいマニュアルを選択して [開く] をクリックしてください。  紙の取扱説明書を簡易化し電子化を推進することで、紙資源使用量を低減しています。  サステナビリティへの取り組み詳細はこちら: [https://connect.panasonic.com/jp-ja/products-services_pc_env](https://connect.panasonic.com/jp-ja/products-services_pc_env)  "
  },
  {
    "title": "パナソニック コネクト株式会社",
    "snippet": "〒540-8553 大阪府大阪市中央区城見2丁目2番33号  © Panasonic Connect Co., Ltd. 2023  " },
  {
    "title": "保証書別添付 ",
    "snippet": "このたびは、パナソニック製品をお買い上げいただき、まことにありがとうございます。  ●取扱説明書をよくお読みのうえ、正しく安全にお使いください。  ●ご使用前に「取扱説明書 ご利用にあたっての注意事項」の「安全上のご注意」を必ずお読みください。  ●保証書は「お買い上げ日・販売店名」などの記入を確かめ、取扱説明書とともに大切に保管してください。  ●本体の品番は、本体底面の品番表示でご確認ください。  " },
    {
      "title": "付属品の確認",
      "snippet": "付属品が足りなかったり、購入したものと異なったりした場合は、お買い上げ販売店にご連絡ください。設置の記載がない場合は各1個付属しています。\n\n■CF-SRシリーズ\n\n| 付属品 | 品番 | 機種名 |\n| --- | --- | --- |\n| バッテリーパック(標準) ※1 | CF-VZSU1YJS | CF-SR4CDMCR |\n|  | CF-VZSU1ZJS | CF-SR4DDNCR |\n| バッテリーパック（軽量）※1 | CF-VZSU2CJS | CF-SR4CDTCR |\n| ACアダプター | CF-AA6412A | CF-SRシリーズ共通 |\n\n■CF-FVシリーズ\n\n| 付属品 | 品番 | 機種名 |\n| --- | --- | --- |\n| バッテリーパック（L）※1 | CF-VZSU1QJS | CF-FV4CDMCR |\n|  | CF-VZSU1SJS | CF-FV4DDNCR |\n| バッテリーパック（S）※1 | CF-VZSU1PJS | CF-FV4CDTCR |\n| ACアダプター | CF-AA6412A | CF-FV4CDMCR、CF-FV4CDTCR |\n|  | CF-AA65D2A | CF-FV4DDNCR |"
    },
  {
    "title": "各シリーズ共通の付属品",
    "snippet": "・電源コード※2\n・保証書\n・取扱説明書 ご利用にあたっての注意事項 \n・取扱説明書 スタートガイド(本書)\n・修理依頼書\nMicrosoft® Office インストール済み\nモデルのみ\n- Office について\n以下はキーボードの上にあります。\n・必ずお読みくださいチラシ\n・メーカー延長保証サービスパック\nのご案内\n※1 バッテリーパックの品番は、バッテリーパック底面でご確認ください。\n※2 電源コードは付属のものを使用してください。また、付属の電源コードは他の" },
  {
    "title": "バッテリーパックを取り付ける",
    "snippet": "●左右のラッチが正しくロックされていない状態で本機を持ち運ぶと、バッテリーパックが外れることがあります。\n\n●バッテリーパックや本機のコネクター部分に触れないでください。\n汚れ、損傷などで接触が悪くなると、充電が正しく行われなかったり、本機が正しく動作しなかったりする場合があります。\nバッテリーパックの取り付け方\n本体を裏返し、バッテリーパックを△マークに合わせて、矢印の方向にスライドして取り付ける\nCF-SRシリーズ: /static/images/3.png\nCF-FV シリーズ: /static/images/4.png"
  },
  {
    "title": "電源を入れる",
    "snippet": "1 ディスプレイを開く\nパソコンの側面に手を添え、ディスプレイを開く\n●ディスプレイをCF-SRシリーズは170°(CF-FVシリーズは160°)以上開いたり、ディスプレイに必要以上の力を加えたりしないでください。\n●ディスプレイを開閉する際は、右図の○印の部分(キャビネット部)をお持ちください。\n●液晶部分の端を持って開閉すると、液晶が破損する場合があります。\n●ディスプレイを開くときにパソコンが浮く場合は、側面などに手を添えて開いてください。\n イラストはCF-SRシリーズです\n/static/images/7.png\n2 パソコンを電源に接続する\n①電源コードとACアダプターを接続する電源コードのプラグ部Ⓐを持ち、まっすぐに奥までしっかりと押し込んでください。接続時に固くて押し込みづらいことがありますが、故障ではありません。\n② ACアダプターをパソコン本体のDC IN⑧に接続する\n③ 電源コードの電源プラグをコンセントに接続するバッテリー状態表示ランプがオレンジ色に点灯し、自動的に充電が始まります。\nイラストはCF-SRシリーズです\n/static/images/8.png"
  },
  {
    "title": "電源を入れる",
    "snippet": "2 パソコンを電源に接続する\n①電源コードとACアダプターを接続する電源コードのプラグ部Ⓐを持ち、まっすぐに奥までしっかりと押し込んでください。接続時に固くて押し込みづらいことがありますが、故障ではありません。\n② ACアダプターをパソコン本体のDC IN⑧に接続する\n③ 電源コードの電源プラグをコンセントに接続するバッテリー状態表示ランプがオレンジ色に点灯し、自動的に充電が始まります。\nイラストはCF-SRシリーズです\n/static/images/8.png"
  },
  {
    "title": "電源を入れる",
    "snippet": "3 電源を入れる\n電源スイッチをスライドし、電源状態表示ランプが点灯したら手を離します。\n注意: \n - 電源スイッチを4秒以上スライドさせたり、連続してスライドさせたりしないでください。\n  # 対応機種別画像  \n- CF-SRシリーズ: /static/images/5.png\n- CF-FVシリーズ: /static/images/6.png\n  電源を切る/復帰する  \n|電源を切る | （タスクバーのをクリック） → （電源） → [シャットダウン] をクリック |\n|------|------|\n|スリープ状態（モダン スタンバイ）または休止状態から復帰する | 電源スイッチをスライドする |\n 電源状態表示ランプについて  \n| 消灯| 電源オフまたは休止状態 |\n|------|------|\n| 点灯| 電源オン |\n| 点滅| スリープ状態（モダン スタンバイ） |\n"
  },
  {
    "title": "Windowsをセットアップする",
    "snippet": "● Windows を使用できるようになるまで、必ずACアダプターを接続した状態にしておいてください。●Windowsのセットアップをするには、インターネットに接続する必要があります。事前に無線LAN あるいは有線LANでインターネットに接続する環境を準備してください。ACアダプター、有線LAN以外の周辺機器は接続しないでください。・セットアップの途中で、Microsoft アカウントを入力する必要があります。セットアップ中に Microsoft カウントを新規に作成できます。お持ちの携帯端末やスマートフォンで、以下のURLにアクセスし、「Windows をセットアップする」の手順に従って進めてください。https://pc-dl.panasonic.co.jp/public/s_manual/windows11/wllsetupC.pdf  QR: /static/images/17.png"},
  {
    "title": "無線LANご使用時のセキュリティ",
    "snippet": "工場出荷時、無線LANのセキュリティに関する設定は行われていません。そのため、電波が届く範囲内であれば通信内容を盗み見られたり、不正に侵入されたりするおそれがあります。無線LANをご使用になる前に、必ず無線LANのセキュリティに関する設定を行ってください。『取扱説明書 操作マニュアル』 「無線機能」 「無線LANについて」の「無線LANに接続する」"},
    {
      "title": "使用/保管に適した環境",
      "snippet": "●平らで衝撃、振動、落下のおそれがない安定した場所\nパソコンが落下すると、本体に衝撃が加わり誤動作や故障の原因になります。\n使用時の環境\n温度:5℃~35℃\n湿度:30%RH~80%RH(結露なきこと)\n保管時の環境\n温度:-20℃~60℃\n湿度:30%RH~90%RH(結露なきこと)\n・上記の範囲内であっても、低温、高温、高湿度など極端に偏った環境で長期間\n使い続けたり、本機の近くでの喫煙や、油を使用する場所、ほこりの多い場所\nでのご使用は、製品の劣化により製品寿命が短くなるおそれがあります。"},
  {
    "title": "使用/保管に適した環境",
    "snippet": "●熱のこもらない環境\n・保温性の高いところ (ゴムシートや布団の上など)での使用は避け、スチール製の事務机など放熱性が優れた場所でお使いください。\n・放熱の妨げとなりますので、タオルや市販の一般的なキーボードカバーなどで覆わずにお使いください。\n・本体のディスプレイは、開いた状態でお使いください。ディスプレイを閉じた状態でも、発煙・発火・故障のおそれはありませんが、温度が上がらないように動作が遅くなったり、パソコンの向き(立てて置くなど)によっては保護のため電源が切れたりする場合があります。\n・通風孔(排気)付近は特に熱くなります。本機を長時間膝の上に乗せて使用しないでください。\n/static/images/9.png"
  },
  {
    "title": "使用/保管に適した環境",
    "snippet": "下図のAの位置に磁気を発生するものを近づけない工場出荷時の設定では、本機のディスプレイを閉じるとディスプレイが消えスリープ状態になります。磁気を発生するものを近づけると、ディスプレイが閉じられたと判断しディスプレイが消え、スリープ状態などになったり、CF-QRシリーズをお使いの場合は、タブレットスタイルになったと判断し、ホイールパッドやキーボードが使えなくなったりする場合があります。\n/static/images/10.png"
  },
  {
    "title": "使用中に本機が熱いと感じたら",
    "snippet": "●CPUの動作や充電時の電流などにより本機やACアダプターが熱くなることがありますが、故障ではありません。\n本機の発熱が気になる場合は、必要に応じて次の手順でファン制御モードを[冷却優先]に設定してください。\n(タスクバーのをクリック) - (PC設定)をクリックして、[設定]-[電源管理]の「熱とファン制御」の [冷却優先]をクリック。\n・通風孔(排気)にほこりがたまると冷却機能が低下します。1ヵ月に一度程度、ダストカバー内部のお手入れをしてください。(→「取扱説明書 活用ガイド」「使用上のお願い」の「お手入れ」)●周辺機器を使用していてパソコン本体が熱くなった場合気温が高い場所でバッテリーパックのみで駆動し、かつUSB機器などの周辺機器を接続している場合、パソコン本体が高温にならないように自動的に休止状態に入ることがあります。\n休止状態に入ったら周辺機器を外し、しばらくたって温度が下がってから復帰してください。"},
  {
    "title": "データ保護",
    "snippet": "データ保護のために次のことをお守りください。\n●データの機密保護としてセキュリティ機能を活用する。\n(➔『取扱説明書 操作マニュアル』 「セキュリティ」)●パソコン本体の取り扱いには十分注意し、衝撃を与えない。\n● Windows やアプリケーションソフトの動作中およびSSD アクセスランプの点灯中は、電源スイッチに触らない。"}
  ,
  {
    "title": "持ち運び時の注意事項",
    "snippet": "持ち運び時の注意事項ディスプレイが破損するおそれがありますので取り扱いには十分注意してください。持ち運ぶ際は、ディスプレイやディスプレイ周りのキャビネット部を持たないでください。\n/static/images/11.png\nキーボード上にペンや書類、ノート、イヤホン等のものをはさんだ状態のままディスプレイを閉じないでください。\n/static/images/12.png\nスペースの少ないカバン、パソコンケース等に硬いものと重ねて詰め込まないでください。\n/static/images/13.png\n自転車のかごに入れて運搬しないでください。非常に強い振動・衝撃が継続して加わり故障の原因になります。\n/static/images/14.png"
  },
  {
    "title": "ディスプレイのお手入れ",
    "snippet": "ディスプレイのお手入れは、ガーゼなどの乾いた布で軽くふいてください。\n/static/images/15.png"
  },
  {
    "title": "Windowsの再インストールについて",
    "snippet": "本機のSSDには保存されたリカバリー領域があり、このリカバリーデータを使ってSSDの内容をお買い上げ時の状態に戻すことができます。\n詳しくは「取扱説明書 活用ガイド」の「再インストールする」をご覧ください。\nまた、リカバリーディスクを作成することもできます。\n詳しい情報は、次のWebページをご覧ください。\nhttps://askpc.panasonic.co.jp/win11/\n「リカバリーイメージ ダウンロードサービス(リカバリーディスクを作成する)」\nQR: /static/images/16.png"},
  {
    "title": "まず、お買い上げの販売店へご相談ください",
    "snippet": "・お買い上げの際に記入されると便利です\n/static/images/18.png\n  ●海外での使用について\n本製品は日本国内仕様であり、海外の規格などには準拠しておりません。海外での使用について、当社では一切責任を負いかねます。\nThis product cannot be used in foreign country as designed for Japan only."
  },
  {
    "title": "修理を依頼されるときは･･･",
    "snippet": "『取扱説明書 活用ガイド』の「このパソコンにトラブルがあったときは」および画面で見る『困ったときのQ&A』に従ってご確認の後、直らないときは、まず電源プラグを抜いて、お買い上げの販売店へご連絡ください。\n●修理を依頼されるときは、修理依頼書をご確認いただき必要事項を記入のうえ、修理されるパソコンに添付してください。\n●保証期間中は、保証書の規定に従ってお買い上げの販売店が修理をさせていただきますので、恐れ入りますが、製品に保証書を添えてご持参ください。保証期間:お買い上げ日から本体1年間(ただし、バッテリーパックは、消耗品ですので保証期間内でも「有料」とさせていただきます)"  },
  {
    "title": "修理を依頼されるときは･･･",
    "snippet": "●保証期間終了後は、診断をして修理できる場合はご要望により修理させていただきます。\n※修理料金は次の内容で構成されています。\n「技術料 診断・修理・調整・点検などの費用\n部品代 部品および補助材料代\n「出張料 技術者を派遣する費用\n※補修用性能部品の保有期間 6当社は、このパーソナルコンピューターの補修用性能部品(製品の機能を維持するための部品)を、製造打ち切り後6年保有しています。\nお問い合わせの際は、機種品番と製造番号をお伝えください\n本体底面の品番表示または保証書に記載しています。\n下の欄にあらかじめ控えておくと便利です。\n"  }
  ,
  {
    "title": "転居や贈答品などでお困りの場合は、お客様ご相談センター、修理ご相談窓口にご連絡ください。 ",
    "snippet": "【ご相談窓口におけるお客さまの個人情報のお取り扱いについて】パナソニック コネクト株式会社およびグループ関係会社は、お客さまの個人情報 をご相談対応や修理対応などに利用させていただき、ご相談内容は録音させて いただきます。また、折り返し電話をさせていただくときのために発信番号を通知いただいております。なお、個人情報を適切に管理し、修理業務などを委託 する場合や正当な理由がある場合を除き、第三者に開示・提供いたしません。個人情報に関するお問い合わせは、ご相談いただきました窓口にご連絡ください。\nパソコンを廃棄または譲渡するときには、パソコン内に記録されているお客さま の重要なデータが流出するというトラブルを回避するために、必ずデータ消去を 行ってください。データ消去の手順については、『取扱説明書 活用ガイド』の「パソコンの廃棄・譲渡時におけるデータ消去について」をご覧ください。\n本機を廃棄・譲渡する際のデータの消去に関しては、下記の情報窓口をご利用 ください。\n- パナソニックのWebベージ\nhttps://connect.panasonic.com/jp-ja/products-services_pc_env_reuse\n パナソニックパソコン お客様ご相談センター\n(フリーダイヤル 0120-873029)パソコンのリサイクルについて\n使用済みになったパソコンを廃棄するときは、下記 Webベージをご覧ください。 https://askpc.panasonic.co.jp/recy/"},
  {
    "title": "消耗品と有寿命部品について",
    "snippet": "本機の部品は、使用しているうちに少しずつ劣化・摩耗します。また、一部の部品の劣化・摩耗が原因で、製品としての性能が十分に発揮されない場合があります。本機 を長く、安全に使用していただくためには、劣化・摩耗した部品を交換することが必要です。当社では、劣化・摩耗の進み方の違いによって、部品を消耗品と有寿命部品 に分類して扱っています。\n| 種類 | 部品 | 備考 |\n| --- | --- | --- |\n| 消耗品 | パッテリーパック | ・お客さまご自身で購入し、交換して いただく部品です。 ・保証期間内でも有償です。 |\n| 有寿命部品 | フラッシュメモリードライブ (SSD) LCD (液晶ディスプレイ)  内蔵キーボード ACアダブター リチウムコイン電池  ファン | ・修理による再生ができない場合  (部品の寿命) に交換する部品です。 ・保証期間内の修理は無償ですが、部品の寿命による交換は、有償に なる場合があります。  ※ 有寿命部品の交換の目安は、事務室で8時間/1日、250日/ 1 年の使用で約 5 年です。ただし、昼夜連続して使用するなど、使用状態によっては保証期間内でも部品の寿命による交換が必要に なる場合があります  (有償になる場合があります)。 |"  },
  {
    "title": "バッテリーパックは消耗品です。",
    "snippet": "ご使用環境やご使用状況によって異なりますが、目安として使用開始後約1~3年\nまたは充電回数が約300~500回で、バッテリーが劣化します。\nバッテリーパックが膨らんできたり、満充電後、短時間で消耗したりするように\nなったら、新しいバッテリーパックと交換してください。" },
  {
    "title": "使い方・お手入れなどのご相談は･･･",
    "snippet": "パナソニック パソコンサポート総合サイト\nhttps://askpc.panasonic.co.jp/index.html\n/static/images/19.png\n(2023年10月現在)\nご使用の回線(IP 電話やひかり電話など)によっては、回線の混雑時に数分で切れる場合があります。本書の「保証とアフターサービス」もご覧ください。" },
  {
    "title": "修理に関するご相談は･･･",
    "snippet": "パナソニックパソコン 修理サービスサイト\nhttps://askpc.panasonic.co.jp/repair/consumer.html\n/static/images/20.png"
  }
  

]